[
  {
    "img": "https://plumbingbazzar.com/uploads/media/2025/Untitled-2_copy1.jpg",
    "name": "Which toilet is best?",
    "text": "Wall-Hung or One-Piece: A wall hung toilet is simply a toilet that is attached to the wall instead of the floor. The toilet's cistern is hidden behind it, as part of the wall. Because of this, the toilet's flusher is often a panel on said wall, rather than a button on the cistern. A one-piece toilet features the tank and bowl as a single, integrated unit, creating a sleek, easy-to-clean design, often with a lower profile than two-piece toilets."
  },
  {
    "img": "https://plumbingbazzar.com/uploads/media/2025/Basin_blog_image.jpg",
    "name": "Guide to different types of basins",
    "text": "A Comprehensive Guide to Popular Basin Types: Wall-Hung, Pedestal, Countertop, Undercounter, Self-Rimming, and Vanity Basins"
  },
  {
    "img": "https://plumbingbazzar.com/uploads/media/2025/P_trap_S_trap_image.jpg",
    "name": "Understanding the difference between P-Trap and S-Trap",
    "text": "P-traps and S-traps are plumbing devices that create a water seal to prevent sewer gases from entering a building, but they differ in shape and function, with S-traps being less common and prone to siphoning issues."
  },
  {
    "img": "https://plumbingbazzar.com/uploads/media/2025/Untitled-3.jpg",
    "name": "A Complete Guide to choosing right faucet for basin",
    "text": "For different basin types, you'll find basin faucets like single-handle, double-handle, wall-mounted, and vessel sink faucets, each designed for specific basin styles and needs."
  },
  {
    "img": "https://plumbingbazzar.com/uploads/media/2025/3d-rendering-classic-modern-bathroom-with-luxury-tile-decor-near-living-room.jpg",
    "name": "Top 5 Luxury Sanitary Ware Brands Available in India",
    "text": "In this post, we unveil the top 5 luxury sanitary ware brands available in India—ideal for anyone looking to bring a blend of sophistication and smart design into their homes."
  },
  {
    "img": "https://plumbingbazzar.com/uploads/media/2025/2222.jpg",
    "name": "Kitchen Sink Buying Guide: Types, Materials & What Works Best for Indian Homes",
    "text": "Choosing the right kitchen sink is more than just picking aesthetics"
  },
  {
    "img": "https://plumbingbazzar.com/uploads/media/2025/ChatGPT_Image_Jul_28,_2025,_04_59_04_PM.png",
    "name": "Sanitary Ware Online: The Secret Weapon of Modern Homeowners",
    "text": "With the rise of e-commerce, many homeowners now prefer to buy sanitary ware online for ease, variety, and cost efficiency. Let’s dive into why going digital with your sanitary shopping is the smartest move today."
  },
  {
    "img": "https://plumbingbazzar.com/uploads/media/2025/340.jpg",
    "name": "Wash Basin Tap Designs That Will Instantly Elevate Your Sink Area",
    "text": "A thoughtfully chosen tap for your wash basin or kitchen sink not only complements the room’s aesthetics but also enhances your daily routine."
  },
  {
    "img": "https://plumbingbazzar.com/uploads/media/2025/ChatGPT_Image_Aug_7,_2025,_12_07_48_PM.png",
    "name": "From Faucets to Flush Tanks: What to Know Before You Buy Sanitary Ware Online",
    "text": "Why Buying Sanitary Ware Online Is a Smart Choice"
  },
  {
    "img": "https://plumbingbazzar.com/uploads/media/2025/ChatGPT_Image_Aug_22,_2025,_01_45_45_PM.png",
    "name": "Everything You Need to Know About Sensor Faucets",
    "text": "If you’ve ever thought about upgrading to one, or you’re simply curious about how they work, this blog will cover everything you need to know about sensor faucets"
  }
]
